/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   1malloc.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: devicii <asroq98@gmail.com>                +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/09/02 13:51:29 by devicii           #+#    #+#             */
/*   Updated: 2021/09/02 13:51:29 by devicii          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>

int swap(int *a, int *b);
//이런 함수가 있다면 swap은 리턴할 필요가 없다. 굳이
//두 수를 받아 스와핑만 하는 것이라 오히려 int반환형을 쓴다면
//가독성이 떨어진다. 이런 것은 void로 바꾸는 것이 낫다.
int main(){
	int a, b;
	scanf("%d %d", &a, &b);
	swap(&a, &b);

	printf("%d : %d \n", a, b);
	return 0;
}

int swap(int *a, int *b){

	int temp;

	temp = *a;
	*a = *b;
	*b = temp;

	return 0;
}
